<script setup lang="ts">

import { reactive } from "vue";

const textBlocks = reactive({
  developingLevel: false,
  lowLevel: false,
  baseLevel: false,
  highLevel: false,
  advancedLevel: false
});
</script>

<template>
  <div class="page-container">
    <div id="communication-skills-img" class="page-main-img">
      <div class="text">
        <div class="title">
          Инструмент
        </div>
        <div class="subtitle">
          ICL test
        </div>
        <div class="description">
          Информационно-коммуникационная компетентность
        </div>
      </div>
    </div>
    <div class="basic-container white-container">
      <p>
        Инструмент <span class="bold-text">ICL test</span> реализован в форме компьютерной системы тестирования на основе
        выполнения аутентичных заданий сценарного типа в контролируемых условиях с автоматизированным процессом обработки
        результатов тестирования и предоставления обратной связи сразу после его прохождения.
      </p>
      <p>
        Целевая аудитория — учащиеся 13-15 лет.
      </p>
      <p>
        Современный человек живет в цифровом мире, в котором невозможно комфортно жить без способности работать с информацией
        в цифровой среде. Показателем этой способности является уровень информационно-коммуникационной компетентности
        (ИК-компетентности). ИК-компетентность — это не только и не столько уровень владения конкретными компьютерными
        программами и цифровыми технологиями, под ИК-компетентностью понимается способность и готовность учащихся использовать
        цифровые технологии, сервисы и инструменты с целью получения доступа, анализа, управления, интеграции, создания
        информации и коммуникации, соблюдая этические и правовые нормы.
      </p>
      <p>
        Особенностью <span class="bold-text">ICL test</span> является то, что он дает возможность оценить способность учащегося
        использовать цифровые среды и сервисы для получения новых знаний, осуществления коммуникации, проведения исследовательской
        деятельности, что, в конечном итоге, поможет учащемуся приобрести навыки обучения в течение всей жизни и выполнении
        будущих профессиональных обязанностей.
      </p>
    </div>
    <div class="basic-container blue-container">
      <div class="title">
        7 составляющих ИК-компетентности,<br>
        которые измеряет ICL test:
      </div>
      <div class="img-container">
        <img alt="communication-skills-components" src="@/assets/tools/communication_skills_components.jpg">
      </div>
      <p>
        Инструмент измерения <span class="bold-text">ICL test</span> разработан на основе метода доказательного оценивания
        (Evidence-Centered Design), в основе которого заложена разработка наблюдаемых доказательств, позволяющих сделать вывод
        об уровне ИК-компетентности учащихся. В оценку включён не только результат выполненных заданий, но и оценивается процесс
        их решения (поведенческие характеристики тестируемых), обработка результатов происходит на основе действий, произведённых
        обучающимися в заданиях при выполнении ICL test.
      </p>
    </div>
    <div class="split-container">
      <div class="title">
        Процедура<br>
        оценивания
      </div>
      <div class="description">
        <p>
          Разработано <span class="bold-text">руководство администратора тестирования</span>, в котором детально описана процедура
          проведения тестирования.
        </p>
        <p>
          Тестирование включает <span class="bold-text">8 аутентичных заданий сценарного типа</span>. На выполнение непосредственно
          тестовых заданий отводится <span class="bold-text">75 минут</span>. В процессе тестирования предусмотрены
          <span class="bold-text">2 перерыва по 5 минут для гимнастики глаз</span> (25 + 25 + 25 минут с двумя перерывами).
        </p>
        <p>
          При выполнении тестовых заданий учащийся использует эмулятор браузера для выхода в Интернет, осуществляет поиск файлов,
          работает с графиками, электронными таблицами и презентациями, пользуется текстовым редактором и электронной почтой,
          общается в социальных сетях и коммуникаторах, запускает мультимедиа и анализирует базы данных.
        </p>
        <p>
          При проведении тестирования используются стационарные или переносные компьютеры (за отдельным компьютером работает
          только один обучающийся), манипуляторы типа мышь. На компьютеры обязательно должна быть установлена последняя версия
          Google Chrome (это единственное требование к программному обеспечению при проведении тестирования).
        </p>
        <p>
          <span class="bold-text">Задания не связаны с предметными знаниями.</span> Сценарии разработаны таким образом, что
          их решение способно заинтересовать школьников, тем самым повышая внутреннюю мотивацию к решению задачи.
        </p>
        <p>
          <span class="bold-text">Контекст заданий</span>: академический, деловой и личностный.
        </p>
        <p>
          <span class="bold-text">Автоматическая обработка результатов</span> с «обратной связью» респонденту сразу после
          окончания тестирования.
        </p>
      </div>
    </div>
    <div class="white-gap"></div>
    <div class="basic-container blue-container">
      <div class="title">
        Обратная связь
      </div>
      <p>
        После прохождения <span class="bold-text">ICL test</span> учащемуся присваивается один из уровней ИК-компетентности —
        в зависимости от того, в какой степени он владеет каждой из семи составляющих. Всего таких уровней пять:
      </p>
      <div class="shifted-div">
        •	<span @click="textBlocks.advancedLevel = !textBlocks.advancedLevel" class="shifted-div-title">Продвинутый уровень</span>
        <span v-if="textBlocks.advancedLevel"> ↖</span>
        <span v-else> ↘</span>
        <br>
        <div v-if="textBlocks.advancedLevel" class="shifted-div-details">
          Учащиеся самостоятельно и квалифицированно используют цифровые технологии для решения учебных задач и задач в
          реальной жизни. При создании информационных продуктов (поиске и выборе информации, форматировании и дизайне материалов)
          учащиеся понимают, для какой аудитории создаются эти продукты. Они осознают, что информация может быть коммерческим
          и подверженным влиянию продуктом, разбираются в вопросах интеллектуальной собственности
        </div>
        •	<span @click="textBlocks.highLevel = !textBlocks.highLevel" class="shifted-div-title">Уровень выше базового</span>
        <span v-if="textBlocks.highLevel"> ↖</span>
        <span v-else> ↘</span>
        <br>
        <div v-if="textBlocks.highLevel" class="shifted-div-details">
          Учащиеся демонстрируют хороший уровень знаний, навыков и понимания при самостоятельном поиске информации и редактировании
          информационных продуктов, а также управления ими. Учащиеся отбирают необходимую информацию из электронных ресурсов,
          адаптируют ее под требования задачи и создают собственные информационные продукты. Они также осознают, что найденная
          информация может быть пристрастной, недостоверной или ненадежной.
        </div>
        •	<span @click="textBlocks.baseLevel = !textBlocks.baseLevel" class="shifted-div-title">Базовый уровень</span>
        <span v-if="textBlocks.baseLevel"> ↖</span>
        <span v-else> ↘</span>
        <br>
        <div v-if="textBlocks.baseLevel" class="shifted-div-details">
          Учащиеся демонстрируют базовый уровень ИК-компетентности. Они могут находить информацию, пользуясь простыми электронными
          ресурсами, выбирают и добавляют содержание информационных продуктов, демонстрируют способность форматировать текст и
          изображения в информационных продуктах, работают с электронными таблицами и графическими редакторами, программами
          для обмена мгновенными сообщениями и другими коммуникаторами. Они понимают необходимость защиты доступа к электронной
          информации и возможные последствия нежелательного доступа к информации.
        </div>
        •	<span @click="textBlocks.lowLevel = !textBlocks.lowLevel" class="shifted-div-title">Уровень ниже базового</span>
        <span v-if="textBlocks.lowLevel"> ↖</span>
        <span v-else> ↘</span>
        <br>
        <div v-if="textBlocks.lowLevel" class="shifted-div-details">
          Учащиеся знакомы с основными программами, могут работать с файлами на компьютере и выполнять простые операции с информацией.
          Учащиеся знают основные правила, использующиеся для коммуникации онлайн, а также последствия использования компьютеров
          неавторизированными пользователями.
        </div>
        •	<span @click="textBlocks.developingLevel = !textBlocks.developingLevel" class="shifted-div-title">Развивающийся уровень</span>
        <span v-if="textBlocks.developingLevel"> ↖</span>
        <span v-else> ↘</span>
        <br>
        <div v-if="textBlocks.developingLevel" class="shifted-div-details">
          Учащиеся плохо работают с основными программами, плохо систематизируют файлы на компьютере и выполняют простые операции
          с информацией (поиск информации, редактирование текста, работа с электронными таблицами, изображениями и т.п.) с ошибками.
          Учащиеся знают основные правила, использующиеся для коммуникации онлайн, но при этом они не понимают ответственности за
          использование и передачу информации с точки зрения законности и соблюдения этических норм.
        </div>
      </div>
      <p>
        По результатам тестирования предоставляется индивидуальная обратная связь учащемуся и родителям, учителю и классу, а
        также обобщённый отчет по школе.
      </p>
      <p>
        Используемый метод доказательного оценивания позволяет выявить и описать пробелы в развитии навыков работы с информацией
        в цифровой среде, над которыми следует работать в рамках учебного процесса.
      </p>
    </div>
  </div>
</template>

<style>
  #communication-skills-img {
    background-image:
      linear-gradient(to bottom, rgba(255, 255, 255, 0.4), rgba(255, 255, 255, 1)),
      url('@/assets/photos/communication_skills_main.jpeg');
  }
</style>
