<script setup lang="ts">

import { reactive } from "vue";

const textBlocks = reactive({
  developingLevel: false,
  baseLevel: false,
  advancedLevel: false,
});
</script>

<template>
  <div class="page-container">
    <div id="digital-skills-img" class="page-main-img">
      <div class="text">
        <div class="title">
          Инструмент
        </div>
        <div class="subtitle">
          DIGLIT
        </div>
        <div class="description">
          Цифровые компетенции
        </div>
      </div>
    </div>
    <div class="basic-container white-container">
      <p>
        Инструмент <span class="bold-text">DIGLIT</span> реализован в форме компьютерной системы тестирования с автоматизированным
        процессом сбора, обработки и оценки результатов и направлен на измерение цифровой грамотности 12-14 летних школьников.
      </p>
      <p>
        Цифровая грамотность является комплексным конструктом, в состав которого входит ряд цифровых навыков, необходимых для
        работы в цифровой среде, что нашло отражение в определении — <span class="bold-text">способность безопасно для себя и
        других использовать цифровые технологии для поиска, анализа, создания, управления информацией, коммуникации и коллективной
        работы с целью решения задач в цифровой среде для удовлетворения личных и образовательных потребностей</span> — и обусловило
        подход к разработке инструмента измерения.
      </p>
    </div>
    <div class="basic-container blue-container">
      <div class="title">
        Какие цифровые навыки измеряются?
      </div>
      <div class="img-container">
        <img alt="digital-skills-components" src="@/assets/tools/digital_skills_components.jpg">
      </div>
      <p>
        Инструмент измерения <span class="bold-text">цифровой грамотности DIGLIT</span> разработан на основе метода доказательной
        аргументации (Evidence-Centered Design), в основе которого заложена разработка наблюдаемых доказательств, позволяющих
        сделать вывод о сформированности измеряемых цифровых компетенций.
      </p>
      <p>
        В качестве <span class="bold-text">формы задания выбран сценарный тип</span>, так как он позволяет добиться максимальной
        аутентичности в отличие от классических форм, моделирует ситуации, с которыми участники тестирования могут столкнуться
        в реальной жизни, например, планирование поездки в неизвестное место, поиск необходимой информации в интернете или
        создание визуализации в мультимедийной программе, создают среду, которая при этом позволяет зафиксировать поведение,
        соответствующее измеряемым цифровым навыкам, и в целом помогает решить задачу внутренней мотивации выполнения теста,
        а, следовательно, повышает степень достоверности полученных результатов.
      </p>
    </div>
    <div class="split-container">
      <div class="title">
        Процедура<br>
        оценивания
      </div>
      <div class="description">
        <p>
          Разработана очень подробная <span class="bold-text">процедура администрирования</span> дистанционного процесса тестирования.
        </p>
        <p>
          Варианты  теста включают <span class="bold-text">4 задания сценарного типа</span>. На выполнение непосредственно тестовых
          заданий отводится <span class="bold-text">60 минут</span>. Для компьютерного тестирования данной возрастной группы (школьники
          12-14 лет) предусмотрены 2 перерыва по 5 минут для гимнастики глаз (20 + 20 + 20 минут с двумя перерывами).
        </p>
        <p>
          <span class="bold-text">Задания не связаны с предметными знаниями.</span> Сценарии разработаны таким образом, что их решение
          способно заинтересовать школьников, тем самым повышая внутреннюю мотивацию к решению задачи.
        </p>
        <p>
          <span class="bold-text">Тестовые задания предполагают использование симуляторов широкого спектра цифровых технологий</span>,
          в том числе браузера, облачного хранилища, мессенджеров, электронной почты, соцсетей, текстовых редакторов, программ создания
          презентаций и др., <span class="bold-text">полностью идентичных подобным в реальной жизни</span>.
        </p>
        <p>
          <span class="bold-text">Контекст заданий:</span> учебный (из школьной среды) и личный (задача из повседневной жизни вне школы).
        </p>
        <p>
          Пример задания можно посмотреть <a class="inline-link" target="_blank" href="https://youtu.be/Hb2kNUn7X6k">здесь</a>.
        </p>
        <p>
          <span class="bold-text">Автоматическая обработка результатов</span> с «обратной связью» респонденту сразу после окончания
          тестирования.
        </p>
        <p>
          <span class="bold-text">Контекстная анкета</span> разработана для выявления факторов, связанных с развитием цифровых навыков
          в быстро меняющейся цифровой среде.
        </p>
      </div>
    </div>
    <div class="white-gap"></div>
    <div class="basic-container blue-container">
      <div class="title">
        Обратная связь
      </div>
      <p>
        В результате тестирования определяется общий уровень цифровой грамотности обучающихся, исходя из трех возможных:
      </p>
      <div class="shifted-div">
        •	<span @click="textBlocks.developingLevel = !textBlocks.developingLevel" class="shifted-div-title">Развивающийся уровень</span>
          <span v-if="textBlocks.developingLevel"> ↖</span>
          <span v-else> ↘</span>
        <br>
        <div v-if="textBlocks.developingLevel" class="shifted-div-details">
          <span class="bold-text">Ученик, находящийся на развивающемся уровне:</span><br>
          •	владеет основами поиска и анализа информации, но не способен выделить релевантную информацию и определить
          надежность источников. Плохо классифицирует информацию, не способен создать информационный продукт по заданным критериям;<br>
          •	способен выполнить предложенную последовательность действий (алгоритм) решения практической задачи;<br>
          •	владеет основными навыками коммуникации в цифровой среде, но, не всегда может выбрать подходящий формат представления
          информации для конкретной целевой аудитории, не соблюдает правила цифрового этикета;<br>
          •	способен обнаружить наиболее очевидные угрозы, но не всегда готов защитить свои устройства; не всегда идентифицирует
          проблемный контент и не способен защитить личные данные;<br>
          •	владеет минимальными техническими навыками работы с цифровыми технологиями, которые не позволяют полностью решить
          задачу в цифровой среде.
        </div>
        •	<span @click="textBlocks.baseLevel = !textBlocks.baseLevel" class="shifted-div-title">Базовый уровень</span>
        <span v-if="textBlocks.baseLevel"> ↖</span>
        <span v-else> ↘</span>
        <br>
        <div v-if="textBlocks.baseLevel" class="shifted-div-details">
          <span class="bold-text">Ученик, находящийся на базовом уровне:</span><br>
          •	способен искать и анализировать информацию, выделять релевантную информацию при этом опираясь на информацию из
          надежных и достоверных источников. Способен классифицировать и систематизировать информацию, создавать простые информационные
          продукты по заданным критериям или создавать сложные информационные продукты с небольшим количеством ошибок;<br>
          •	способен не только выполнить предложенную последовательность действий, но и составить свой алгоритм для решения задачи;<br>
          •	способен коммуницировать в цифровой среде с пониманием основных норм и правил общения, может выбрать формат представления
          информации для конкретной целевой аудитории;<br>
          •	способен идентифицировать риски, но не всегда готов защитить свои устройства и данные;<br>
          •	владеет техническими навыками, достаточными для решения задач в цифровых средах.
        </div>
        •	<span @click="textBlocks.advancedLevel = !textBlocks.advancedLevel" class="shifted-div-title">Продвинутый уровень</span>
        <span v-if="textBlocks.advancedLevel"> ↖</span>
        <span v-else> ↘</span>
        <br>
        <div v-if="textBlocks.advancedLevel" class="shifted-div-details">
          <span class="bold-text">Ученик, находящийся на продвинутом уровне:</span><br>
          •	способен как искать и анализировать информацию, так и формулировать правильное решение поставленной задачи, опираясь
          на надежные и достоверные источники, классифицировать и организовывать информацию для быстрого нахождения и оптимального
          использования при решении задач, создавать информационные продукты, соответствующие возрасту, по заданным критериям без
          ошибок;<br>
          •	способен выполнить предложенную последовательность действий, составить свой алгоритм для решения задачи и провести
          его оптимизацию;<br>
          •	способен выстроить эффективную коммуникацию для решения задачи с соблюдением этических и правовых норм;<br>
          •	способен обнаружить угрозы и защитить свои устройства, избегать рисков работы в цифровой среде и полностью защитить
          свои конфиденциальные данные;<br>
          •	свободно использует цифровые технологии при решении задач, решает сложные пользовательский задачи в цифровых средах
          и может помочь другим.
        </div>
      </div>
      <p>
        По результатам тестирования предоставляется индивидуальная обратная связь школьнику и родителям, учителю и классу,
        а также обобщённый отчет по школе.
      </p>
      <p>
        Используемый метод доказательного оценивания позволяет выявить и описать пробелы в развитии цифровых компетенций
        школьника, над которыми следует поработать. Пример индивидуального отчета школьника для базового уровня цифровой
        грамотности:
      </p>
      <div class="img-container">
        <img alt="digital-skills-report-example" src="@/assets/tools/digital_skills_report_example.jpg">
      </div>
    </div>
  </div>
</template>

<style>
  #digital-skills-img {
    background-image:
        linear-gradient(to bottom, rgba(255, 255, 255, 0.4), rgba(255, 255, 255, 1)),
        url('@/assets/photos/digital_skills_main.jpeg');
  }
</style>
