<script setup lang="ts">
import VueScrollTo from 'vue-scrollto'

const scrollToEl = (elId) => {
  VueScrollTo.scrollTo(document.getElementById(elId), 500, {easing: 'ease-in'});
};
</script>

<template>
  <div class="about">
    <div class="title">
      <span>Future Assessment Service</span>
      <br>
      <span>Оцениваем настоящее. Строим будущее.</span>
    </div>
    <div class="content">
      <div class="subnavigation">
        <span @click="scrollToEl('our-mission')">Наша миссия</span>
        <span @click="scrollToEl('our-values')">Наши ценности</span>
        <span @click="scrollToEl('our-team')">Наша команда</span>
      </div>
      <span id="our-mission" class="subtitle">Наша миссия</span>
      <div class="subpart">
        <p>
          <span class="bold">Future Assessment Service</span> соединяет последние разработки в области психометрики и
          искусственного интеллекта с современными научными представлениями о психологии и образовании, чтобы помочь
          каждому ученику раскрыть свой образовательный потенциал.
        </p>
        <p>
          Мы считаем, что основа обучения — это персонализированная обратная связь, которая объясняет, какие шаги ученику
          и всем людям вокруг него нужно предпринять, чтобы повысить образовательные достижения ученика наиболее быстро.
          Однако для того, чтобы ее предоставить, необходимо иметь самые точные инструменты измерения, использующие
          технологии искусственного интеллекта и психометрики. Более того, такая обратная связь должна быть
          индивидуализированной и оперативной.
        </p>
        <p>
          Миссия <span class="bold">Future Assessment Service</span> — это разрабатывать такие инструменты измерения,
          которые могли бы давать <span class="bold">формирующую обратную связь</span> каждому ученику, учителю, родителю
          и администратору для принятия решений об индивидуальном образовательном маршруте каждого ученика и управления
          образовательными организациями.
        </p>
        <p>
          То, что отличает нас от многих образовательных компаний — это применение технологий психометрики и
          искусственного интеллекта к <span class="bold">современным психологическим и образовательным теориям</span>. С
          самого начала разработки наших инструментов измерения, мы закладываем в них наиболее доказанные и валидные
          теории из социальных наук, чтобы сделать обратную связь наиболее легкой для интерпретации и понятной
          пользователям.
        </p>
        <p>
          Одно из главных преимуществ наших инструментов — это возможность <span class="bold">измерения образовательного
          прогресса</span> и изменений во времени. В физкультуре измерить образовательный прогресс (например, высоту
          прыжка) очень просто, потому что шкала достижений не изменяется со временем. Но измерение прогресса, например, в
          математике требует специальных психометрических приемов и статистического моделирования. Нельзя просто
          сравнивать баллы по двум разным тестам по одному предмету — задания в них имеют разную трудность, поэтому одно и
          то же число баллов не означает один и тот же уровень способности.
        </p>
        <p>
          При разработке наших инструментов, мы руководствуемся <span class="bold">стандартами образовательного и
          психологического тестирования</span>, разработанными ведущими психометрическими организациями в мире:
          Американской Ассоциацией Исследований в Образовании, Национальным Советом по Образовательным Измерениям, и
          Американской Психологической Ассоциацией; Международной Тестовой Комиссией; Европейской Федерацией
          Психологических Ассоциаций; Ассоциацией Образовательного Оценивания в Европе. Согласно этим стандартам, все наши
          тесты проходят процедуры валидизации, включающие изучение надежности, доказательства целесообразности и
          достоверности обратной связи, а также гендерного и национального равенства и справедливости.
        </p>
        <p>
          Наши сотрудники являются академическими специалистами с международной квалификации в психологии, науках об
          образовании, психометрике, науках о данных и статистике.
        </p>
        <p>
          Мы сотрудничаем с учителями, учащимися и профессионалами в образовании по всему миру. Мы открыты к обратной
          связи от всех групп пользователей наших инструментов.
        </p>
        <p>
          <span class="bold">Наша миссия</span> — помочь школам и ученикам добиться успеха, используя наши передовые
          решения для оценки и измерения в психологии и образовании.
        </p>
      </div>
      <span id="our-values" class="subtitle">Наши ценности</span>
      <div class="subpart">
        <span class="bold">
          Все, что мы делаем, строится на наших фундаментальных ценностях:
        </span>
        <ul>
          <li>
            <div class="highlighted">Инновации</div>
            <span>Мы исследуем новые идеи и методы оценки, чтобы лучше заботиться об интересах наших клиентах.</span>
          </li>
          <li>
            <div class="highlighted">Качество</div>
            <span>Мы стремимся делать качественные измерения.</span>
          </li>
          <li>
            <div class="highlighted">Сотрудничество</div>
            <span>Мы верим, что совместные усилия и взаимодействие с партнерами — ключевой фактор успеха.</span>
          </li>
          <li>
            <div class="highlighted">Равенство и справедливость</div>
            <span>Мы предпринимаем усилия, соответствующие современным академическим стандартам, чтобы убедиться, что
            наши инструменты не дискриминируют ни одну из групп учеников.</span>
          </li>
          <li>
            <div class="highlighted">Инклюзивность</div>
            <span>Мы разрабатываем изменения в наших инструментах, которые позволяют сделать результаты учеников с
            ограниченными возможностями здоровья сопоставимыми с результатами учеников без них.</span>
          </li>
          <li>
            <div class="highlighted">Скорость</div>
            <span>Обратная связь важна только когда она предоставляется непосредственно по результатам измерения.</span>
          </li>
          <li>
            <div class="highlighted">Ответственность</div>
            <span>Мы предпринимаем усилия для того, чтобы по результатам наших измерений не принимались неправомерные
            решения.</span>
          </li>
        </ul>
      </div>
      <span id="our-team" class="subtitle">Наша команда</span>
      <div class="subpart">
        <p>
          Наша команда гордится своей способностью разрабатывать новые решения в сфере оценивания. За каждым членом
          команды стоит большой опыт в сфере оценивания в образовании: от разработки и экспертизы тестов до
          инновационных технологий обработки, шкалирования и анализа результатов тестирования до предоставления обратной
          связи и работы в интересах клиентов.
        </p>
      </div>
    </div>
  </div>
</template>

<style>
.about {
  font-size: 25px;
  display: flex;
  flex-direction: column;
}

.about .title {
  width: 75%;
}

.about .subnavigation {
  width: 100%;
  text-align: center;
  font-size: 14px;
  padding-bottom: 20px;
}

.about .subnavigation span {
  padding: 0 10px;
  border-right: 1px solid var(--vt-c-divider-light-1);
}

.about .subnavigation span:last-of-type {
  border-right: 0;
}

@media (hover: hover) {
  .about .subnavigation span:hover {
    color: var(--fas-red);
    cursor: pointer;
  }
}

</style>
